
#include "pub.c" ///Выводит переменную любого зарегистрированного типа 
#include "len.c" ///Определяет длину содержимого любой переменной
#include "toc.c" ///получает 1 сивол из строки и ковертирует ллюой тип в char
#include "tos.c" ///получает 1 элемент из массива и конвертирует любой тип в char*
#include "toi.c" ///конвертирует любой тип в инт если позволяет размер
#include "tol.c" ///конвертирует любой тип в лонг если поволяет размер
#include "tod.c" ///конвертирует любой тип в double если поволяет размер
#include "told.c" ///конвертирует любой тип в double если поволяет размер
#include "tof.c" ///конвертирует любой тип в float если поволяет размер

#include "get.c" //Универсальное получение данных из адреса или в файл, порт
#include "cpy.c" //Универсальное коприрование в память
#include "con.c" //Универсальное объединение переменных
#include "set.c" //Универсальная отправка данных в адрес или в фай, порт

#include "ex.c" //дробит на массив, в случае масива делает 1 объект

#include "un.c" //создает только уникальный элемент или массив
#include "mem.c"//Производит поиск в памяти
#include "is.c"	//Проверяет наличие переменной функции получает разные параметры
#include "so.c"	//Сортирует любой тип представляя его как массив
#include "rex.c"//заменять, возвращать массив

