#include "arg/arg.c" //Требуется в переборке и оптимизации
/*!~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
Релиз функций/макросов для работы с функциями, редакция 13.01.13
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~!*/
#define obj($_p...)({(obj)arg((void*)$_p);})                			///создание массива аргуметов для объекта
///---------------------------------------------------------------------
#define set_fun($_addr,$_type,$_parent,$_narg)({                               \
set_fun_item((func)&$_addr,#$_addr,#$_type,(uni)$_parent,($_narg)?$_narg:-1);  \
})                                                        ///регистрация адреса функции
//----------------------------------------------------------------------
#define new($_addr,$_type,$_p...)({                                     \
set_fun_item((func)&$_addr,#$_addr,#$_type,(uni)$_addr,-1);              \
($_type)(*$_addr)($_p);})                                  ///Регистрация и вызов объекта
///---------------------------------------------------------------------
#define proc($_type,$_f,$_p...)({										\
set_type_item(#$_type);													\
uni $_addr=get_fun_name(#$_f);												\
func $_call=(func)$_addr;												\
($_type)$_call(arg($_p));												\
}) 															//!не документирована
//----------------------------------------------------------------------
#define fun($_type,$_f,$_p...)({										\
uni $_addr=get_fun_name(#$_f);											\
func $_call=(func)$_addr;												\
($_type)$_call((uni*)$_p);												\
})														  //!не документирована
///---------------------------------------------------------------------add fun alias
#define proto($_name,$_add_name)(set_fun_proto(#$_name,#$_add_name)) ///производит аналогию между основным именем и добавляет дополнительное	
